/***************************************************************************************
 *	File Name				:		bootpack.h
 *	CopyRight				:		1.0
 *	ModuleName				:		
 *
 *	Create Data				:		2016/01/06
 *	Author/Corportation		:		ZhuoJianhuan
 *
 *	Abstract Description	:		启动盘主程序
 *
 *--------------------------------Revision History--------------------------------------
 *	No	version		Data			Revised By			Item			Description
 *	1	v1.0		2016/01/06		ZhuoJianhuan						Create this file
 *
 ***************************************************************************************/
/**************************************************************
*	Multi-Include-Prevent Section
**************************************************************/
#ifndef __BOOT_PACK_H
#define __BOOT_PACK_H
/**************************************************************
*	Debug switch Section
**************************************************************/

/**************************************************************
*	Include File Section
**************************************************************/
#include "asmhead.h"
#include "naskfunc.h"
#include "fifo.h"
#include "graphic.h"
#include "memory.h"
#include "sheet.h"
#include "timer.h"
#include "mtask.h"
#include "int.h"
#include "dsctbl.h"
#include "keyboard.h"
#include "mouse.h"
#include "window.h"
#include "file.h"
#include "console.h"
/**************************************************************
*	Macro Define Section
**************************************************************/
/**************************************************************
*	Struct Define Section
**************************************************************/
/**************************************************************
*	Global Variable Declare Section
**************************************************************/
/**************************************************************
*	Prototype Declare Section
**************************************************************/
/**************************************************************
*	End-Multi-Include-Prevent Section
**************************************************************/
#endif




