/***************************************************************************************
 *	File Name				:		keyboard.h
 *	CopyRight				:		1.0
 *	ModuleName				:		keyboard module
 *
 *	Create Data				:		2016/01/06
 *	Author/Corportation		:		ZhuoJianhuan
 *
 *	Abstract Description	:		键盘输入输出函数的声明文件
 *
 *--------------------------------Revision History--------------------------------------
 *	No	version		Data			Revised By			Item			Description
 *	1	v1.0		2016/01/06		ZhuoJianhuan						Create this file
 *
 ***************************************************************************************/
/**************************************************************
*	Multi-Include-Prevent Section
**************************************************************/
#ifndef __KEYBOARD_H
#define __KEYBOARD_H
/**************************************************************
*	Debug switch Section
**************************************************************/

/**************************************************************
*	Include File Section
**************************************************************/
/**************************************************************
*	Macro Define Section
**************************************************************/
#define PORT_KEYDAT		0x0060
#define PORT_KEYCMD		0x0064
/**************************************************************
*	Struct Define Section
**************************************************************/
/**************************************************************
*	Global Variable Declare Section
**************************************************************/
/**************************************************************
*	Prototype Declare Section
**************************************************************/
/**
 *	@description	初始化键盘模块
 *	@param			fifo：关联键盘的缓冲
 *					data0：键盘使用的关键字
 */
void init_keyboard(struct FIFO32 *fifo, int data0);

/**
 *	@description	等待键盘就绪
 */
void wait_KBC_sendready(void);

/**
 *	@description	键盘中断服务函数
 */
void inthandler21(int *esp);
/**************************************************************
*	End-Multi-Include-Prevent Section
**************************************************************/
#endif


