/***************************************************************************************
 *	FileName					:	login.c
 *	CopyRight					:	1.0
 *	ModuleName					:	login management module
 *
 *	Create Data					:	2016/01/06
 *	Author/Corportation			:	ZhuoJianhuan
 *
 *	Abstract Description		:	登录输入输出模块管理
 *
 *--------------------------------Revision History--------------------------------------
 *	No	version		Date			Revised By			Item			Description
 *	1	v1.0		2016/01/06		ZhuoJianhuan						Create this file
 *
 ***************************************************************************************/
/**************************************************************
*	Debug switch Section
**************************************************************/

/**************************************************************
*	Include File Section
**************************************************************/
#include "bootpack.h"
/**************************************************************
*	Macro Define Section
**************************************************************/
/**************************************************************
*	Struct Define Section
**************************************************************/
/**************************************************************
*	Prototype Declare Section
**************************************************************/
/**************************************************************
*	Global Variable Declare Section
**************************************************************/
/**************************************************************
*	File Static Variable Define Section
**************************************************************/
struct SHEET *sht_win;
unsigned char * buf_win;
/**************************************************************
*	Function Define Section
**************************************************************/
/**
 *	@description	初始化键盘模块
 *	@param			fifo：关联键盘的缓冲
 *					data0：键盘使用的关键字
 */
void initLogin(struct SHTCTL *shtctl, int w, int h){
	sht_win   = sheet_alloc(shtctl);
	buf_win   = (unsigned char *) malloc_4k(w * h);
	sheet_setbuf(sht_win, buf_win, w, h, -1);
}